# Этап 1. Компиляция двоичного файла в контейнизированном окружении Golang
#
FROM golang:1.18 as build

# Скопировать исходные файлы с хоста.
COPY . /src

# Назначить рабочим каталог с исходным кодом
WORKDIR /src

# Собрать двоичный файл!
RUN CGO_ENABLED=0 GOOS=linux go build -o kvs

# Этап 2. Сборка образа со службой хранилища пар ключ/значение
#
# Использовать образ "scratch", не содержащий распростаняемых файлов
FROM scratch

# Скопировать двоичный файл из контейнера build
COPY --from=build /src/kvs .

# Скопировать имеющиеся файлы PEM
COPY --from=build /src/*.pem .

# Скопировать файл конфигурации
COPY --from=build /src/.env .

# Сообщить Docker, что служба будет использовать порт 8080.
EXPOSE 8080

# Команда, которая должна быть выполнена при запуске контейнера
CMD ["/kvs"]
