# Родительский образ. На этапе сборки этот образ будет извлечен,
# и последующие инструкции будут манипулировать им.
FROM ubuntu:20.04

# Обновить кеш apt и установить nginx без запроса подтверждения.
RUN apt-get update && apt-get install --yes nginx

# Сообщить Docker, что контейнеры, создаваемые на основе этого образа,
# будут использовать порт 80.
EXPOSE 80

# Запустить Nginx на переднем плане. Это важно: в отсутствие
# процесса переднего плана контейнер автоматически остановиться
CMD ["nginx", "-g", "daemon off;"]
